// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

let season = Number(prompt("Введи число от 1 до 4:"));
let reasult = "";
switch (season) {
    case 1:
        reasult = "зима";
        break;

        case 2:
        reasult = "весна";
        break;

        case 3:
        reasult = "лето";
        break;

        case 4:
        reasult = "осень";
        break;

    default:
        reasult = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
        break;
};
console.log(reasult);

