// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


let login = prompt("Введите логин:");
let pass = "";
if (login === "admin") {
    pass = prompt("пароль")
    if (pass === "Я головний"){
        alert("Добрий день!");
}
    else if (pass === null || pass === "") {
        alert("отмена!!!");
    } else {
        alert("не верный пароль");
    }
}
else if (login === null || login === "") {
    alert("отмена!!!");
 }
else {
    alert("Я вас не знаю");
 };